infrastructure/results/stress-test/k6-stress-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: stress-slo-violation.js
        output: json (../results/stress-test/k6-stress.json)

     scenarios: (100.00%) 3 scenarios, 550 max VUs, 2m20s max duration (incl. graceful stop):
              * warmup: 10.00 iterations/s for 20s (maxVUs: 20-50, gracefulStop: 30s)
              * spike: 100.00 iterations/s for 1m0s (maxVUs: 200-500, startTime: 20s, gracefulStop: 30s)
              * cooldown: 20.00 iterations/s for 30s (maxVUs: 30-50, startTime: 1m20s, gracefulStop: 30s)

time="2026-01-18T22:45:03+07:00" level=warning msg="Error from API server" error="listen tcp 127.0.0.1:6565: bind: address already in use"
time="2026-01-18T22:45:03+07:00" level=info msg="\n🔥 SLO Violation Stress Test" source=console
time="2026-01-18T22:45:03+07:00" level=info msg="============================" source=console
time="2026-01-18T22:45:03+07:00" level=info msg="Target: http://localhost:18082" source=console
time="2026-01-18T22:45:03+07:00" level=info msg="Endpoint: /fib?n=35 (CPU-intensive ~400ms per request)" source=console
time="2026-01-18T22:45:03+07:00" level=info msg="Goal: Trigger SCALE_OUT decisions by exceeding SLO threshold" source=console
time="2026-01-18T22:45:03+07:00" level=info source=console
time="2026-01-18T22:45:03+07:00" level=info msg="Phase A (0-20s): Warmup @ 10 RPS" source=console
time="2026-01-18T22:45:03+07:00" level=info msg="Phase B (20-80s): Spike @ 100 RPS (should saturate K8s)" source=console
time="2026-01-18T22:45:03+07:00" level=info msg="Phase C (80-110s): Cooldown @ 20 RPS" source=console
time="2026-01-18T22:45:03+07:00" level=info source=console

Run        [ 100% ] setup()
warmup     [   0% ]
spike      [   0% ]
cooldown   [   0% ]

Run        [ 100% ] setup()
warmup     [   0% ]
spike      [   0% ]
cooldown   [   0% ]

Run        [ 100% ] setup()
warmup     [   0% ]
spike      [   0% ]
cooldown   [   0% ]

running (0m04.0s), 010/230 VUs, 0 complete and 0 interrupted iterations
warmup     [   5% ] 10/20 VUs  01.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    19.0s     
cooldown • [   0% ] waiting    1m19.0s   

running (0m05.0s), 020/230 VUs, 0 complete and 0 interrupted iterations
warmup     [  10% ] 20/20 VUs  02.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    18.0s     
cooldown • [   0% ] waiting    1m18.0s   

running (0m06.0s), 025/235 VUs, 0 complete and 0 interrupted iterations
warmup     [  15% ] 25/25 VUs  03.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    17.0s     
cooldown • [   0% ] waiting    1m17.0s   

running (0m07.0s), 030/240 VUs, 0 complete and 0 interrupted iterations
warmup     [  20% ] 30/30 VUs  04.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    16.0s     
cooldown • [   0% ] waiting    1m16.0s   

running (0m08.0s), 035/245 VUs, 0 complete and 0 interrupted iterations
warmup     [  25% ] 35/35 VUs  05.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    15.0s     
cooldown • [   0% ] waiting    1m15.0s   

running (0m09.0s), 040/250 VUs, 0 complete and 0 interrupted iterations
warmup     [  30% ] 40/40 VUs  06.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    14.0s     
cooldown • [   0% ] waiting    1m14.0s   

running (0m10.0s), 045/255 VUs, 0 complete and 0 interrupted iterations
warmup     [  35% ] 45/45 VUs  07.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    13.0s     
cooldown • [   0% ] waiting    1m13.0s   

running (0m11.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  40% ] 50/50 VUs  08.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    12.0s     
cooldown • [   0% ] waiting    1m12.0s   
time="2026-01-18T22:45:14+07:00" level=warning msg="Insufficient VUs, reached 50 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=warmup

running (0m12.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  45% ] 50/50 VUs  09.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    11.0s     
cooldown • [   0% ] waiting    1m11.0s   

running (0m13.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  50% ] 50/50 VUs  10.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    10.0s     
cooldown • [   0% ] waiting    1m10.0s   

running (0m14.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  55% ] 50/50 VUs  11.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    09.0s     
cooldown • [   0% ] waiting    1m09.0s   

running (0m15.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  60% ] 50/50 VUs  12.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    08.0s     
cooldown • [   0% ] waiting    1m08.0s   

running (0m16.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  65% ] 50/50 VUs  13.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    07.0s     
cooldown • [   0% ] waiting    1m07.0s   

running (0m17.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  70% ] 50/50 VUs  14.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    06.0s     
cooldown • [   0% ] waiting    1m06.0s   

running (0m18.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  75% ] 50/50 VUs  15.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    05.0s     
cooldown • [   0% ] waiting    1m05.0s   

running (0m19.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  80% ] 50/50 VUs  16.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    04.0s     
cooldown • [   0% ] waiting    1m04.0s   

running (0m20.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  85% ] 50/50 VUs  17.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    03.0s     
cooldown • [   0% ] waiting    1m03.0s   

running (0m21.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  90% ] 50/50 VUs  18.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    02.0s     
cooldown • [   0% ] waiting    1m02.0s   

running (0m22.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [  95% ] 50/50 VUs  19.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    01.0s     
cooldown • [   0% ] waiting    1m01.0s   

running (0m23.0s), 050/260 VUs, 0 complete and 0 interrupted iterations
warmup     [ 100% ] 50/50 VUs  20.0s/20s  10.00 iters/s
spike    • [   0% ] waiting    00.0s     
cooldown • [   0% ] waiting    1m00.0s   

running (0m24.0s), 148/260 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   2% ] 098/200 VUs  0m01.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m59.0s      

running (0m25.0s), 248/260 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   3% ] 198/200 VUs  0m02.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m58.0s      

running (0m26.0s), 299/309 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   5% ] 249/249 VUs  0m03.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m57.0s      

running (0m27.0s), 349/359 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   7% ] 299/299 VUs  0m04.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m56.0s      

running (0m28.0s), 399/409 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [   8% ] 349/349 VUs  0m05.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m55.0s      

running (0m29.0s), 449/459 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  10% ] 399/399 VUs  0m06.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m54.0s      

running (0m30.0s), 499/509 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  12% ] 449/449 VUs  0m07.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m53.0s      

running (0m31.0s), 549/550 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  13% ] 499/499 VUs  0m08.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m52.0s      
time="2026-01-18T22:45:34+07:00" level=warning msg="Insufficient VUs, reached 500 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=spike

running (0m32.0s), 550/550 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  15% ] 500/500 VUs  0m09.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m51.0s      

running (0m33.0s), 550/550 VUs, 0 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  17% ] 500/500 VUs  0m10.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m50.0s      

running (0m34.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  18% ] 500/500 VUs  0m11.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m49.0s      

running (0m35.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  20% ] 500/500 VUs  0m12.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m48.0s      

running (0m36.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  22% ] 500/500 VUs  0m13.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m47.0s      

running (0m37.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  23% ] 500/500 VUs  0m14.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m46.0s      

running (0m38.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  25% ] 500/500 VUs  0m15.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m45.0s      

running (0m39.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  27% ] 500/500 VUs  0m16.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m44.0s      

running (0m40.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  28% ] 500/500 VUs  0m17.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m43.0s      

running (0m41.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  30% ] 500/500 VUs  0m18.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m42.0s      

running (0m42.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  32% ] 500/500 VUs  0m19.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m41.0s      

running (0m43.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  33% ] 500/500 VUs  0m20.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m40.0s      

running (0m44.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  35% ] 500/500 VUs  0m21.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m39.0s      

running (0m45.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  37% ] 500/500 VUs  0m22.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m38.0s      

running (0m46.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  38% ] 500/500 VUs  0m23.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m37.0s      

running (0m47.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  40% ] 500/500 VUs  0m24.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m36.0s      

running (0m48.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  42% ] 500/500 VUs  0m25.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m35.0s      

running (0m49.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  43% ] 500/500 VUs  0m26.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m34.0s      

running (0m50.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  45% ] 500/500 VUs  0m27.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m33.0s      

running (0m51.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  47% ] 500/500 VUs  0m28.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m32.0s      

running (0m52.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  48% ] 500/500 VUs  0m29.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m31.0s      

running (0m53.0s), 503/550 VUs, 57 complete and 0 interrupted iterations
warmup   ↓ [ 100% ] 50/50 VUs    20s           10.00 iters/s
spike      [  50% ] 500/500 VUs  0m30.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m30.0s      

running (0m54.0s), 500/550 VUs, 57 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  52% ] 500/500 VUs  0m31.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m29.0s      

running (0m55.0s), 500/550 VUs, 57 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  53% ] 500/500 VUs  0m32.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m28.0s      

running (0m56.0s), 500/550 VUs, 57 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  55% ] 500/500 VUs  0m33.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m27.0s      

running (0m57.0s), 500/550 VUs, 58 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  57% ] 500/500 VUs  0m34.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m26.0s      

running (0m58.0s), 500/550 VUs, 58 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  58% ] 500/500 VUs  0m35.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m25.0s      

running (0m59.0s), 500/550 VUs, 58 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  60% ] 500/500 VUs  0m36.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m24.0s      

running (1m00.0s), 500/550 VUs, 58 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  62% ] 500/500 VUs  0m37.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m23.0s      

running (1m01.0s), 500/550 VUs, 58 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  63% ] 500/500 VUs  0m38.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m22.0s      

running (1m02.0s), 500/550 VUs, 58 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  65% ] 500/500 VUs  0m39.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m21.0s      

running (1m03.0s), 500/550 VUs, 58 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  67% ] 500/500 VUs  0m40.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m20.0s      

running (1m04.0s), 112/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  68% ] 112/500 VUs  0m41.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m19.0s      

running (1m05.0s), 212/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  70% ] 212/500 VUs  0m42.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m18.0s      

running (1m06.0s), 312/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  72% ] 312/500 VUs  0m43.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m17.0s      

running (1m07.0s), 412/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  73% ] 412/500 VUs  0m44.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m16.0s      

running (1m08.0s), 500/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  75% ] 500/500 VUs  0m45.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m15.0s      

running (1m09.0s), 500/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  77% ] 500/500 VUs  0m46.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m14.0s      

running (1m10.0s), 500/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  78% ] 500/500 VUs  0m47.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m13.0s      

running (1m11.0s), 500/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  80% ] 500/500 VUs  0m48.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m12.0s      

running (1m12.0s), 500/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  82% ] 500/500 VUs  0m49.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m11.0s      

running (1m13.0s), 500/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  83% ] 500/500 VUs  0m50.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m10.0s      

running (1m14.0s), 500/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  85% ] 500/500 VUs  0m51.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m09.0s      

running (1m15.0s), 500/550 VUs, 533 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  87% ] 500/500 VUs  0m52.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m08.0s      

running (1m16.0s), 500/550 VUs, 534 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  88% ] 500/500 VUs  0m53.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m07.0s      

running (1m17.0s), 500/550 VUs, 537 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  90% ] 500/500 VUs  0m54.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m06.0s      

running (1m18.0s), 500/550 VUs, 539 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  92% ] 500/500 VUs  0m55.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m05.0s      

running (1m19.0s), 500/550 VUs, 543 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  93% ] 500/500 VUs  0m56.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m04.0s      

running (1m20.0s), 500/550 VUs, 546 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  95% ] 500/500 VUs  0m57.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m03.0s      

running (1m21.0s), 500/550 VUs, 549 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  97% ] 500/500 VUs  0m58.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m02.0s      

running (1m22.0s), 400/550 VUs, 731 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [  98% ] 400/500 VUs  0m59.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m01.0s      

running (1m23.0s), 499/550 VUs, 732 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s           10.00 iters/s
spike      [ 100% ] 499/500 VUs  1m00.0s/1m0s  100.00 iters/s
cooldown • [   0% ] waiting      0m00.0s      

running (1m24.0s), 520/550 VUs, 732 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [   3% ] 20/30 VUs    01.0s/30s  20.00 iters/s

running (1m25.0s), 534/550 VUs, 733 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [   7% ] 35/35 VUs    02.0s/30s  20.00 iters/s

running (1m26.0s), 544/550 VUs, 733 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  10% ] 45/45 VUs    03.0s/30s  20.00 iters/s
time="2026-01-18T22:46:30+07:00" level=warning msg="Insufficient VUs, reached 50 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=cooldown

running (1m27.0s), 549/550 VUs, 733 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  13% ] 50/50 VUs    04.0s/30s  20.00 iters/s

running (1m28.0s), 549/550 VUs, 733 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  17% ] 50/50 VUs    05.0s/30s  20.00 iters/s

running (1m29.0s), 548/550 VUs, 734 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  20% ] 50/50 VUs    06.0s/30s  20.00 iters/s

running (1m30.0s), 548/550 VUs, 734 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  23% ] 50/50 VUs    07.0s/30s  20.00 iters/s

running (1m31.0s), 548/550 VUs, 734 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  27% ] 50/50 VUs    08.0s/30s  20.00 iters/s

running (1m32.0s), 548/550 VUs, 734 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  30% ] 50/50 VUs    09.0s/30s  20.00 iters/s

running (1m33.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  33% ] 50/50 VUs    10.0s/30s  20.00 iters/s

running (1m34.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  37% ] 50/50 VUs    11.0s/30s  20.00 iters/s

running (1m35.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  40% ] 50/50 VUs    12.0s/30s  20.00 iters/s

running (1m36.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  43% ] 50/50 VUs    13.0s/30s  20.00 iters/s

running (1m37.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  47% ] 50/50 VUs    14.0s/30s  20.00 iters/s

running (1m38.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  50% ] 50/50 VUs    15.0s/30s  20.00 iters/s

running (1m39.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  53% ] 50/50 VUs    16.0s/30s  20.00 iters/s

running (1m40.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  57% ] 50/50 VUs    17.0s/30s  20.00 iters/s

running (1m41.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  60% ] 50/50 VUs    18.0s/30s  20.00 iters/s

running (1m42.0s), 547/550 VUs, 735 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  63% ] 50/50 VUs    19.0s/30s  20.00 iters/s

running (1m43.0s), 546/550 VUs, 736 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  67% ] 50/50 VUs    20.0s/30s  20.00 iters/s

running (1m44.0s), 323/550 VUs, 977 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  70% ] 02/50 VUs    21.0s/30s  20.00 iters/s

running (1m45.0s), 323/550 VUs, 997 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  73% ] 02/50 VUs    22.0s/30s  20.00 iters/s

running (1m46.0s), 323/550 VUs, 1017 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  77% ] 02/50 VUs    23.0s/30s  20.00 iters/s

running (1m47.0s), 323/550 VUs, 1037 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  80% ] 02/50 VUs    24.0s/30s  20.00 iters/s

running (1m48.0s), 323/550 VUs, 1057 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  83% ] 02/50 VUs    25.0s/30s  20.00 iters/s

running (1m49.0s), 323/550 VUs, 1077 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  87% ] 02/50 VUs    26.0s/30s  20.00 iters/s

running (1m50.0s), 323/550 VUs, 1097 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  90% ] 02/50 VUs    27.0s/30s  20.00 iters/s

running (1m51.0s), 323/550 VUs, 1117 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  93% ] 02/50 VUs    28.0s/30s  20.00 iters/s

running (1m52.0s), 323/550 VUs, 1137 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [  97% ] 02/50 VUs    29.0s/30s  20.00 iters/s

running (1m53.0s), 325/550 VUs, 1155 complete and 3 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s        10.00 iters/s
spike    ↓ [ 100% ] 500/500 VUs  1m0s       100.00 iters/s
cooldown   [ 100% ] 04/50 VUs    30.0s/30s  20.00 iters/s

running (1m54.0s), 005/550 VUs, 1155 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (1m55.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (1m56.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (1m57.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (1m58.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (1m59.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (2m00.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (2m01.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (2m02.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (2m03.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (2m04.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s

running (2m05.0s), 002/550 VUs, 1158 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ↓ [ 100% ] 04/50 VUs    30s   20.00 iters/s
time="2026-01-18T22:47:09+07:00" level=info msg="\n📊 Stress Test Results" source=console
time="2026-01-18T22:47:09+07:00" level=info msg="======================" source=console
time="2026-01-18T22:47:09+07:00" level=info msg="Duration: 123s" source=console
time="2026-01-18T22:47:09+07:00" level=info msg="\n🔍 Check routing daemon logs for SCALE_OUT decisions" source=console
time="2026-01-18T22:47:09+07:00" level=info msg="Expected: High p99 latency during spike triggers Algorithm 1 SCALE_OUT" source=console


  █ THRESHOLDS 

    http_req_duration{phase:spike}
    ✗ 'p(99)<5000' p(99)=56.35s

    http_req_duration{phase:warmup}
    ✗ 'p(99)<500' p(99)=30.46s

    slo_violations
    ✓ 'count>10' count=962


  █ TOTAL RESULTS 

    checks_total.......................: 4640   36.862307/s
    checks_succeeded...................: 13.92% 646 out of 4640
    checks_failed......................: 86.07% 3994 out of 4640

    ✗ status is 200
      ↳  1% — ✓ 20 / ✗ 1140
    ✗ response < 200ms (SLO)
      ↳  17% — ✓ 198 / ✗ 962
    ✗ response < 1s
      ↳  18% — ✓ 211 / ✗ 949
    ✗ response < 5s
      ↳  18% — ✓ 217 / ✗ 943

    CUSTOM
    errors..................................................................: 98.27% 1140 out of 1160
    response_time...........................................................: avg=23798.034 min=0.229    med=21641.025 max=58075.007 p(90)=39186.5298 p(95)=39794.05525
    slo_violations..........................................................: 962    7.642573/s

    HTTP
    http_req_duration.......................................................: avg=23.78s    min=229µs    med=21.63s    max=58.07s    p(90)=39.18s     p(95)=39.79s     
      { expected_response:true }............................................: avg=2.09s     min=180.3ms  med=489.84ms  max=29.73s    p(90)=1.5s       p(95)=2.99s      
      { phase:spike }.......................................................: avg=29.34s    min=180.3ms  med=33.4s     max=58.07s    p(90)=39.46s     p(95)=39.93s     
      { phase:warmup }......................................................: avg=27.06s    min=22.61s   med=27.41s    max=30.51s    p(90)=30.05s     p(95)=30.28s     
    http_req_failed.........................................................: 98.19% 1140 out of 1161
    http_reqs...............................................................: 1161   9.223521/s

    EXECUTION
    dropped_iterations......................................................: 5318   42.248653/s
    iteration_duration......................................................: avg=23.79s    min=307.25µs med=21.64s    max=58.07s    p(90)=39.19s     p(95)=39.79s     
    iterations..............................................................: 1160   9.215577/s
    vus.....................................................................: 2      min=0            max=550
    vus_max.................................................................: 550    min=230          max=550

    NETWORK
    data_received...........................................................: 240 kB 1.9 kB/s
    data_sent...............................................................: 118 kB 935 B/s



running (2m05.9s), 000/550 VUs, 1160 complete and 324 interrupted iterations
warmup   ✓ [ 100% ] 03/50 VUs    20s   10.00 iters/s
spike    ✓ [ 100% ] 321/500 VUs  1m0s  100.00 iters/s
cooldown ✓ [ 100% ] 00/50 VUs    30s   20.00 iters/s
time="2026-01-18T22:47:10+07:00" level=error msg="thresholds on metrics 'http_req_duration{phase:spike}, http_req_duration{phase:warmup}' have been crossed"